src/cf/maERP_ib/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатурыПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦеныПоТипуЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаМинимальная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоТипуЦен</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/maERP_ib/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/maERP_ib/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/maERP_ib/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ManagerModule.bsl
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Иначе	
		Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПоставщиками(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		Контрагент = ДокОбъект.Контрагент;
		Если Контрагент.СвояКомпания Тогда Возврат; КонецЕсли;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеТоваровУслугТЧТовары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ПоступлениеТоваровУслугТЧТовары.Номенклатура КАК Номенклатура,
	                      |	ПоступлениеТоваровУслугТЧТовары.Характеристика КАК Характеристика,
	                      |	ПоступлениеТоваровУслугТЧТовары.Упаковка КАК Упаковка,
	                      |	ПоступлениеТоваровУслугТЧТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |	ПоступлениеТоваровУслугТЧТовары.СуммаСНДС * ВЫБОР
	                      |		КОГДА ПоступлениеТоваровУслугТЧТовары.Ссылка.Валюта = &ВалютаРегл
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ПоступлениеТоваровУслугТЧТовары.Ссылка.КурсВалюты
	                      |	КОНЕЦ КАК Сумма
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваровУслуг.ТЧТовары КАК ПоступлениеТоваровУслугТЧТовары
	                      |ГДЕ
	                      |	ПоступлениеТоваровУслугТЧТовары.Ссылка = &Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка),
	                      |	ОприходованиеТоваровТЧТовары.Номенклатура,
	                      |	ОприходованиеТоваровТЧТовары.Характеристика,
	                      |	ОприходованиеТоваровТЧТовары.Упаковка,
	                      |	ОприходованиеТоваровТЧТовары.КоличествоУпаковок,
	                      |	ОприходованиеТоваровТЧТовары.Сумма
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров.ТЧТовары КАК ОприходованиеТоваровТЧТовары
	                      |ГДЕ
	                      |	ОприходованиеТоваровТЧТовары.Ссылка = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	&Период КАК Период,
	                      |	&Контрагент КАК Контрагент,
	                      |	ВЗ.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Упаковка КАК Упаковка,
	                      |	ВЗ.Цена КАК Цена,
	                      |	ВЗ.Цена / ВЫБОР
	                      |		КОГДА ВЗ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ВЗ.Упаковка.Числитель / ВЗ.Упаковка.Знаменатель
	                      |	КОНЕЦ КАК ЦенаЕдиницыХранения
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТ.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |		ВТ.Номенклатура КАК Номенклатура,
	                      |		ВТ.Характеристика КАК Характеристика,
	                      |		ВТ.Упаковка КАК Упаковка,
	                      |		СРЕДНЕЕ(ВТ.Сумма / ВТ.КоличествоУпаковок) КАК Цена
	                      |	ИЗ
	                      |		ВТ КАК ВТ
	                      |	ГДЕ
	                      |		ВТ.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТ.НоменклатураКонтрагента,
	                      |		ВТ.Номенклатура,
	                      |		ВТ.Характеристика,
	                      |		ВТ.Упаковка) КАК ВЗ");
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
   	ДокОбъект.Движения.ЦеныНоменклатурыПоставщиков.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Функция ПоследнийПрайс(ДатаЦен, Номенклатура, Контрагент = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Период КАК Период,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Контрагент КАК Контрагент,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.Характеристика КАК Характеристика,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ЦеныНоменклатурыПоставщиковСрезПоследних.ЦенаЕдиницыХранения КАК Цена
	                      |ПОМЕСТИТЬ ВТЦеныПоставщиков
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
	                      |			&ДатаЦен,
	                      |			Номенклатура В (&Номенклатура)
	                      |				И ВЫБОР
	                      |					КОГДА &Контрагент = НЕОПРЕДЕЛЕНО
	                      |						ТОГДА ИСТИНА
	                      |					ИНАЧЕ Контрагент = &Контрагент
	                      |				КОНЕЦ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТЦеныПоставщиков.Контрагент КАК Контрагент,
	                      |	ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
	                      |	ВТЦеныПоставщиков.Характеристика КАК Характеристика,
	                      |	ВТЦеныПоставщиков.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	                      |	ВТЦеныПоставщиков.Цена КАК Цена,
	                      |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
	                      |		ВТЦеныПоставщиков.Характеристика КАК Характеристика,
	                      |		ВТЦеныПоставщиков.Период КАК Период,
	                      |		МАКСИМУМ(ВТЦеныПоставщиков.Контрагент) КАК Контрагент
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ВТЦеныПоставщиков.Номенклатура КАК Номенклатура,
	                      |			ВТЦеныПоставщиков.Характеристика КАК Характеристика,
	                      |			МАКСИМУМ(ВТЦеныПоставщиков.Период) КАК Период
	                      |		ИЗ
	                      |			ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ВТЦеныПоставщиков.Номенклатура,
	                      |			ВТЦеныПоставщиков.Характеристика) КАК ВЗ
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	                      |			ПО ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
	                      |				И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
	                      |				И ВЗ.Период = ВТЦеныПоставщиков.Период
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТЦеныПоставщиков.Номенклатура,
	                      |		ВТЦеныПоставщиков.Характеристика,
	                      |		ВТЦеныПоставщиков.Период) КАК ВЗ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныПоставщиков КАК ВТЦеныПоставщиков
	                      |		ПО ВЗ.Номенклатура = ВТЦеныПоставщиков.Номенклатура
	                      |			И ВЗ.Характеристика = ВТЦеныПоставщиков.Характеристика
	                      |			И ВЗ.Период = ВТЦеныПоставщиков.Период
	                      |			И ВЗ.Контрагент = ВТЦеныПоставщиков.Контрагент");
	Запрос.УстановитьПараметр("ДатаЦен", ДатаЦен);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
